change graph to mermaid format which renders natively in GitHub
